#include <stdarg.h>

#include <limits.h>

#define N 7

int data[] = {0, INT_MAX / 17, INT_MAX, INT_MIN, INT_MIN + 1,
              UINT_MAX / 17, INT_MAX / 17};

int vsprintf(char *out, const char *fmt, va_list ap);

int printf(const char *fmt, ...)
{
    char ans[4000];
    va_list ap;
    int ret = 0;
    va_start(ap, fmt);
    ret = vsprintf(ans, fmt, ap);
    va_end(ap);
    return ret;
}

int vsprintf(char *out, const char *fmt, va_list ap)
{
    int j = 0, k = 0 ,i = 0;
    int val, num[64] = {0};
    const char* str;
    while (*fmt != '\0')
    {
        switch (*fmt)
        {
            case '%':
                //精度,中间还没留精度的选项
                fmt++;
                if (*fmt >= 'a' && *fmt <= 'z')
                {
                    switch (*fmt)
                    {
                        case 'd':
                            val = va_arg(ap, int);
                            k = 0;
                            if (val == 0x80000000)
                            {
                                out[j++] = '-';out[j++] = '2';out[j++] = '1';out[j++] = '4';out[j++] = '7';out[j++] = '4';
                                out[j++] = '8';out[j++] = '3';out[j++] = '6';out[j++] = '4';out[j++] = '8';
                                fmt++;
                                break;
                            }
                            else if (val < 0)
                            {
                                val = (-1) * val;
                                out[j++] = '-';
                            }
                            do
                            {
                                num[k++] = val % 10 + '0';
                                val = val / 10;
                            } while (val != 0);
                            for (int ii = k - 1; ii >= 0; ii--)
                            {
                                out[j++] = num[ii];
                            }
                            fmt++;
                            break;
                        case 's':
                            str = va_arg(ap, char *);
                            i= 0;
                            while(str[i] != '\0')
                            {
                                out[j++] = str[i++];
                            }
                            fmt++;
                            break;
                            //other fuctions remaining to be realized.
                    }
                } //处理标志符及一个字母中间的数
                break;
            default:
                out[j++] = *fmt;
                fmt++;
        }
    }
    out[j] = '\0';
    return j;
}


int main()
{
    char ch[2000] = {"######################%'``|######################$\n"
                     "###################$` ..`.  '&###################$\n"
                     "#################$` .`::::'`  '&#################$\n"
                     "###############$` .`::;!;::::`. '&###############$\n"
                     "#############$` .`:::::|$%;::::`  '&#############$\n"
                     "###########$` .'::::::!%$$$%;::::`. '&###########$\n"
                     "#########$` .'::::::!%$$$$$%;::::::`  '&#########$\n"
                     "#######$` .'::::::!%$%|$$$$%;::::::::`. '&#######$\n"
                     "#####$` .'::::::!%$%;:|$$$$|;::::::::::`  '&#####$\n"
                     "###$` .';;;;;;!%$%;;;;|$$$$|;::::;|%!::::`. '&###$\n"
                     "#&' .';;;%%!!%$%;;;;;;%$$$$|;;;;;;;|$%!;:::`. '@#$\n"
                     "%.  ';;;;;|$$%!;;;;;;!%$$$$!;;;;;!%$%%$%!;;:`  '&$\n"
                     "|    `;;;;;;|$%!;;;;;!$$$$%!;;;!%$%!;;;;;;:`   .%$\n"
                     "@:  ;!``;;;;;;;;;;;;;|$$$$%!;!%$%!;;;;;;:`'!'  :@$\n"
                     ";   '%$!``;;;;;;;;;;;|$$$$%!%$%!;;;;;;:`'|$|`   |$\n"
                     "|    .:%$!`';;;;;;;;!%$$$$$$%!;;;;;;:`'|$|'    .%$\n"
                     "#$`    .:%$|`';;;;;;!%$$$$%!;;;;;;:`'|$|'     ;##$\n"
                     "###$`    .:%$|`';;;;;!%$%|!;;;;;;`'%$|'     ;####$\n"
                     "#####$`    .:%$|`';!!!!!!!!!!!;`'%$%'     ;######$\n"
                     "#######$`    .:$$|`';!!!!!!!;`'%$%'     ;########$\n"
                     "#########$`    .:$$|`';!!!;`'%$%'     ;##########$\n"
                     "###########$`    .:$&|`.`.'%&%'     ;@###########$\n"
                     "#############$`    .:$&$$&&%'     ;##############$\n"
                     "###############$`    .:$&%'     ;@###############$\n"
                     "#################$`           ;##################$\n"
                     "\n"
                     "                  **Project-N**\n"
                     " Nanjing University Computer System Project Series\n"
                     "       Build a computer system from scratch!"};
    printf("%s\n",ch);
}
